---
kind: method
id: M:Autodesk.Revit.DB.ImportInstance.GetVisibility
source: html/08de9969-d4c6-1893-ce64-59e5692da23f.htm
---
# Autodesk.Revit.DB.ImportInstance.GetVisibility Method

Gets the visibility for the import instance in a family document.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the import instance in a family document.